src/Enums/Roles_Rights/Roles_Rights.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Roles_Rights</name>
  <enumValues>
    <name>ActiveUsers</name>
  </enumValues>
  <enumValues>
    <name>Administration</name>
  </enumValues>
  <enumValues>
    <name>AnalyticsSystemClient</name>
  </enumValues>
  <enumValues>
    <name>Automation</name>
  </enumValues>
  <enumValues>
    <name>CollaborationSystemInfoBaseRegistration</name>
  </enumValues>
  <enumValues>
    <name>ConfigurationExtensionsAdministration</name>
  </enumValues>
  <enumValues>
    <name>DataAdministration</name>
  </enumValues>
  <enumValues>
    <name>Delete</name>
  </enumValues>
  <enumValues>
    <name>Edit</name>
  </enumValues>
  <enumValues>
    <name>EditDataHistoryVersionComment</name>
  </enumValues>
  <enumValues>
    <name>EventLog</name>
  </enumValues>
  <enumValues>
    <name>ExclusiveMode</name>
  </enumValues>
  <enumValues>
    <name>Execute</name>
  </enumValues>
  <enumValues>
    <name>ExternalConnection</name>
  </enumValues>
  <enumValues>
    <name>Get</name>
  </enumValues>
  <enumValues>
    <name>InputByString</name>
  </enumValues>
  <enumValues>
    <name>Insert</name>
  </enumValues>
  <enumValues>
    <name>InteractiveActivate</name>
  </enumValues>
  <enumValues>
    <name>InteractiveChangeOfPosted</name>
  </enumValues>
  <enumValues>
    <name>InteractiveClearDeletionMark</name>
  </enumValues>
  <enumValues>
    <name>InteractiveClearDeletionMarkPredefinedData</name>
  </enumValues>
  <enumValues>
    <name>InteractiveDelete</name>
  </enumValues>
  <enumValues>
    <name>InteractiveDeleteMarked</name>
  </enumValues>
  <enumValues>
    <name>InteractiveDeleteMarkedPredefinedData</name>
  </enumValues>
  <enumValues>
    <name>InteractiveDeletePredefinedData</name>
  </enumValues>
  <enumValues>
    <name>InteractiveExecute</name>
  </enumValues>
  <enumValues>
    <name>InteractiveInsert</name>
  </enumValues>
  <enumValues>
    <name>InteractiveOpenExtDataProcessors</name>
  </enumValues>
  <enumValues>
    <name>InteractiveOpenExtReports</name>
  </enumValues>
  <enumValues>
    <name>InteractivePosting</name>
  </enumValues>
  <enumValues>
    <name>InteractivePostingRegular</name>
  </enumValues>
  <enumValues>
    <name>InteractiveSetDeletionMark</name>
  </enumValues>
  <enumValues>
    <name>InteractiveSetDeletionMarkPredefinedData</name>
  </enumValues>
  <enumValues>
    <name>InteractiveStart</name>
  </enumValues>
  <enumValues>
    <name>InteractiveUndoPosting</name>
  </enumValues>
  <enumValues>
    <name>MainWindowModeEmbeddedWorkplace</name>
  </enumValues>
  <enumValues>
    <name>MainWindowModeFullscreenWorkplace</name>
  </enumValues>
  <enumValues>
    <name>MainWindowModeKiosk</name>
  </enumValues>
  <enumValues>
    <name>MainWindowModeNormal</name>
  </enumValues>
  <enumValues>
    <name>MainWindowModeWorkplace</name>
  </enumValues>
  <enumValues>
    <name>MobileClient</name>
  </enumValues>
  <enumValues>
    <name>Output</name>
  </enumValues>
  <enumValues>
    <name>Posting</name>
  </enumValues>
  <enumValues>
    <name>Read</name>
  </enumValues>
  <enumValues>
    <name>ReadDataHistory</name>
  </enumValues>
  <enumValues>
    <name>ReadDataHistoryOfMissingData</name>
  </enumValues>
  <enumValues>
    <name>SaveUserData</name>
  </enumValues>
  <enumValues>
    <name>Set</name>
  </enumValues>
  <enumValues>
    <name>Start</name>
  </enumValues>
  <enumValues>
    <name>SwitchToDataHistoryVersion</name>
  </enumValues>
  <enumValues>
    <name>TechnicalSpecialistMode</name>
  </enumValues>
  <enumValues>
    <name>ThickClient</name>
  </enumValues>
  <enumValues>
    <name>ThinClient</name>
  </enumValues>
  <enumValues>
    <name>TotalsControl</name>
  </enumValues>
  <enumValues>
    <name>UndoPosting</name>
  </enumValues>
  <enumValues>
    <name>Update</name>
  </enumValues>
  <enumValues>
    <name>UpdateDataBaseConfiguration</name>
  </enumValues>
  <enumValues>
    <name>UpdateDataHistory</name>
  </enumValues>
  <enumValues>
    <name>UpdateDataHistoryOfMissingData</name>
  </enumValues>
  <enumValues>
    <name>UpdateDataHistorySettings</name>
  </enumValues>
  <enumValues>
    <name>UpdateDataHistoryVersionComment</name>
  </enumValues>
  <enumValues>
    <name>Use</name>
  </enumValues>
  <enumValues>
    <name>View</name>
  </enumValues>
  <enumValues>
    <name>ViewDataHistory</name>
  </enumValues>
  <enumValues>
    <name>WebClient</name>
  </enumValues>
</mdclass:Enum>

src/Enums/Roles_MetadataSubtype/Roles_MetadataSubtype.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Roles_MetadataSubtype</name>
  <enumValues>
    <name>Attribute</name>
  </enumValues>
  <enumValues>
    <name>Dimension</name>
  </enumValues>
  <enumValues>
    <name>Resource</name>
  </enumValues>
  <enumValues>
    <name>StandardAttribute</name>
  </enumValues>
  <enumValues>
    <name>Command</name>
  </enumValues>
  <enumValues>
    <name>Recalculation</name>
  </enumValues>
  <enumValues>
    <name>AccountingFlag</name>
  </enumValues>
  <enumValues>
    <name>ExtDimensionAccountingFlag</name>
  </enumValues>
  <enumValues>
    <name>AddressingAttribute</name>
  </enumValues>
  <enumValues>
    <name>TabularSection</name>
  </enumValues>
  <enumValues>
    <name>StandardTabularSection</name>
  </enumValues>
  <enumValues>
    <name>Operation</name>
  </enumValues>
  <enumValues>
    <name>URLTemplate</name>
  </enumValues>
  <enumValues>
    <name>Method</name>
  </enumValues>
</mdclass:Enum>

src/Enums/Roles_MetadataTypes/Roles_MetadataTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Roles_MetadataTypes</name>
  <enumValues>
    <name>AccountingRegister</name>
  </enumValues>
  <enumValues>
    <name>AccumulationRegister</name>
  </enumValues>
  <enumValues>
    <name>BusinessProcess</name>
  </enumValues>
  <enumValues>
    <name>CalculationRegister</name>
  </enumValues>
  <enumValues>
    <name>Catalog</name>
  </enumValues>
  <enumValues>
    <name>ChartOfAccounts</name>
  </enumValues>
  <enumValues>
    <name>ChartOfCalculationTypes</name>
  </enumValues>
  <enumValues>
    <name>ChartOfCharacteristicTypes</name>
  </enumValues>
  <enumValues>
    <name>CommonAttribute</name>
  </enumValues>
  <enumValues>
    <name>CommonCommand</name>
  </enumValues>
  <enumValues>
    <name>CommonForm</name>
  </enumValues>
  <enumValues>
    <name>Configuration</name>
  </enumValues>
  <enumValues>
    <name>Constant</name>
  </enumValues>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
  <enumValues>
    <name>Document</name>
  </enumValues>
  <enumValues>
    <name>DocumentJournal</name>
  </enumValues>
  <enumValues>
    <name>ExchangePlan</name>
  </enumValues>
  <enumValues>
    <name>FilterCriterion</name>
  </enumValues>
  <enumValues>
    <name>HTTPService</name>
  </enumValues>
  <enumValues>
    <name>InformationRegister</name>
  </enumValues>
  <enumValues>
    <name>IntegrationService</name>
  </enumValues>
  <enumValues>
    <name>Report</name>
  </enumValues>
  <enumValues>
    <name>Role</name>
  </enumValues>
  <enumValues>
    <name>Sequence</name>
  </enumValues>
  <enumValues>
    <name>SessionParameter</name>
  </enumValues>
  <enumValues>
    <name>Subsystem</name>
  </enumValues>
  <enumValues>
    <name>Task</name>
  </enumValues>
  <enumValues>
    <name>WebService</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/Roles_SettingsReUse/Module.bsl
Function MetaNameByRef(RefData) Export
	RefNameType = RefData.Metadata().Name;
	ValueIndex = Enums[RefNameType].IndexOf(RefData);
	Return Metadata.Enums[RefNameType].EnumValues[ValueIndex].Name;
EndFunction

Function PictureList() Export
	
	PictureLibData = New Structure;
	For Each Pic In Metadata.CommonPictures Do
		If NOT StrStartsWith(Pic.Name, "Roles_") Then
			Continue;
		EndIf;
		PictureLibData.Insert(Pic.Name, PictureLib[Pic.Name]);
	EndDo;	
	Return PictureLibData;

EndFunction

Function MetaRolesName() Export
	
	RolesData = New Structure;
	For Each Roles In Enums.Roles_Rights Do
		RolesData.Insert(Roles_Settings.MetaName(Roles), 2);
	EndDo;	
	Return RolesData;

EndFunction

Function ArrayForViewEdit() Export
	ArrayForViewEdit = New Array;
	ArrayForViewEdit.Add(PredefinedValue("Enum.Roles_MetadataSubtype.Attribute"));
	ArrayForViewEdit.Add(PredefinedValue("Enum.Roles_MetadataSubtype.TabularSection"));
	ArrayForViewEdit.Add(PredefinedValue("Enum.Roles_MetadataSubtype.StandardAttribute"));
	ArrayForViewEdit.Add(PredefinedValue("Enum.Roles_MetadataSubtype.Dimension"));
	ArrayForViewEdit.Add(PredefinedValue("Enum.Roles_MetadataSubtype.Resource"));
	ArrayForViewEdit.Add(PredefinedValue("Enum.Roles_MetadataSubtype.AccountingFlag"));
	ArrayForViewEdit.Add(PredefinedValue("Enum.Roles_MetadataSubtype.ExtDimensionAccountingFlag"));
	ArrayForViewEdit.Add(PredefinedValue("Enum.Roles_MetadataSubtype.AddressingAttribute"));
	ArrayForViewEdit.Add(PredefinedValue("Enum.Roles_MetadataSubtype.StandardTabularSection"));
	Return ArrayForViewEdit;
EndFunction

Function Skip(ObjectType, ObjectSubtype, RoleName) Export
	ArrayForViewEdit = Roles_SettingsReUse.ArrayForViewEdit();
	If NOT ObjectSubtype.isEmpty() Then
		If RoleName = "View" Then
			If ObjectSubtype = Enums.Roles_MetadataSubtype.Command
				OR NOT ArrayForViewEdit.Find(ObjectSubtype) = Undefined Then
				Return False;
			Else
				Return True;
			EndIf;
		ElsIf (RoleName = "Read" OR RoleName = "Update")
			AND ObjectSubtype = Enums.Roles_MetadataSubtype.Recalculation Then
			Return False;
		ElsIf RoleName = "Edit" 
			AND NOT ArrayForViewEdit.Find(ObjectSubtype) = Undefined Then
			Return False;
		Else	
			Return True;
		EndIf;
	Else
		If RoleName = "Edit" Then 
			If ObjectType = Enums.Roles_MetadataTypes.DataProcessor
				OR ObjectType = Enums.Roles_MetadataTypes.Report
				OR ObjectType = Enums.Roles_MetadataTypes.DocumentJournal Then
				Return True;
			Else 
				Return False;
			EndIf;
		Else	
			Return False;
		EndIf;
	EndIf;
	Return False;
EndFunction
